[
    {
        "title": "Huawei nova 9 hands-on review",
        "img": "https://fdn.gsmarena.com/imgroot/reviews/21/huawei-nova-9/hands-on/lifestyle/-1200w5/gsmarena_006.jpg",
        "description": "The nova 9 Pro gets faster 100W charging and a slightly smaller 4,000 mAh battery than the nova 9. The main difference, however is the display and, naturally, device size. The nova 9 has 6.57-inch, 1080 x 2340-pixel display inside a 160 x 73.7 x 7.8 mm, 175-gram body. The nova 9 Pro has a slightly bigger 6.72-inch, 1236 x 2676-pixel panel and a 163.4 x 74.4 x 8 mm, 186-gram body",
        "postingDate": "28 June, 2023"
    },
    {
        "title": "Realme GT Neo 2",
        "img": "https://fdn.gsmarena.com/imgroot/reviews/21/realme-gt-neo2/lifestyle/-1200w5/gsmarena_001.jpg",
        "description": "The original Realme GT was released in March, and the toned-down version named GT Neo followed shortly after. Interestingly enough, a successor to the latter is already out in China, and it's about to make its rounds globally, starting with India. The Realme GT Neo2 isn't just your ordinary hardware refresh, though. The handset offers quite a few welcome upgrades over its predecessor, while its pricing is just as aggressive. It's also the first Neo phone to reach European shores",
        "postingDate": "28 June, 2023"
    },
    {
        "title": "iPhone 14 Pro Max",
        "img": "https://adminapi.applegadgetsbd.com/storage/media/large/iPhone-14-Pro-Max-9907.jpg",
        "description": "Apple iPhone 14 Pro Max- the latest name of Apples Pro Max lineup. Gives you a magical interaction with its groundbreaking features innovative camera functionality, and outstanding outlook. All these specs are combined together and make the iPhone 14 Pro Max one of the best iPhone to date.iPhone 14 Pro Max is filled with some excellent features. The most attractive ones are- its always-on display and 48MP camera with bigger lenses. This leading-edge camera packs some pro-grade camera features that offer you to traverse through a beautiful photographic experience.",
        "postingDate": "28 June, 2023"
    }
]